## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                        NAME                                        |
|----------|------------------------------------------------------------------------------------|
| update   | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket.this`                     |
| recreate | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_public_access_block.this` |
| add      | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_acl.this`                 |
|          | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_ownership_controls.this`  |
|          | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_policy.this`              |
|          | `module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_versioning.this`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cds_salesforce_backups_logs_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cds_salesforce_backups_logs_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::cds-salesforce-backups-access-logs",
              + "arn:aws:s3:::cds-salesforce-backups-access-logs/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-salesforce-backups-access-logs"
      ~ tags                        = {
            "CostCentre" = "platform-core-services"
          ~ "Critical"   = "false" -> "true"
            "Terraform"  = "true"
        }
      ~ tags_all                    = {
          ~ "Critical"   = "false" -> "true"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "cds-salesforce-backups-access-logs"
      + id     = (known after apply)
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "cds-salesforce-backups-access-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "cds-salesforce-backups-access-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "cds-salesforce-backups-access-logs" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "cds-salesforce-backups-access-logs" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cds_salesforce_backups_logs_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cds_salesforce_backups_bucket.aws_s3_bucket.this,
  on .terraform/modules/cds_salesforce_backups_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_to_bucket"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
